#salome miladze

# შექმენით თქვენი ფილმების სია, რომელშიც ჩაწერთ უკვე ნანახ ფილმებს.
# მომხმარებელს(თქვენს პირობით მეგობარს) შემოატანინეთ მის მიერ რეკომენდირებული ფილმი. 
# თუ ფილმი დაემთხვევა თქვენს სიაში არსებულ ფილმს დაწერეთ “ძალიან მომეწონა ეს ფილმი ან არ მომეწონა ეს ფილმი” 
# თუ არ გაქვს ნანახი “ჩავინიშნავ და აუცილებლად ვნახავ”

list=["titanic","home alone","gladiator","godfarher","saw"]
list2=["bad boys","limitles","notokay"]
user=input("enter your recomendet film: ")
if list==user:
        print("ძალიან მომეწონა ეს ფილმი")
    # elif user==list2:
    #     print("არ მომეწონა ეს ფილმი")
else:
        print("ჩავინიშნავ და აუცილებლად ვნახავ")