#rostom chagunava

# შემოიტანეთ აპლიკანტის: სიმაღლე (>= 1,6 და <=2,3) წონა (>=55 და <= 130) ასაკი (>=18 და <=27),
#  თუ აპლიკანტის მონაცემები აკმაყოფილებს შესაბამის მთხოვნებს,მაშინ დაობეჭდოს " გილოცავთ!, 
#  თქვენ ჩაირიცხეთ სავალდებულო სამხედრო სამსახურში" და თუ არ აკმაყოფილებს მაიშინ დაობეჭდოს 
#  "სამწუხაროდ თქვენი მონაცემები არ შესაბამება ჩვენს მოთხოვნებს"

height=float(input("enter your height cm: "))
weight=float(input("enter your weight: "))
age=int(input("etner your age: "))
if height>=166 and height<=230 and weight>=55 and weight<=130 and age>=18 and age<=27:
    print(" გილოცავთ!,თქვენ ჩაირიცხეთ სავალდებულო სამხედრო სამსახურში")
else:
    print("სამწუხაროდ თქვენი მონაცემები არ შესაბამება ჩვენს მოთხოვნებს")